Catalogs/ВидыРаботСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыРаботСотрудников</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Трудоемкость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьТрудоемкости</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КвалификационныйРазряд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазрядыКатегорииДолжностей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасценкаЗаЧасРаботы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасценкаПоТарифнойСетке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ТарифныеСтавки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТарифныеСтавки</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Разряд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазрядыКатегорииДолжностей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РасценкиРаботСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РасценкиРаботСотрудников</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Расценка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРаботСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КвалификационныйРазряд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазрядыКатегорииДолжностей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ДополнительныеРазрезыТарифнойСетки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ДополнительныеРазрезыТарифнойСетки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезДетализации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подразделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Организация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ВидыРаботСотрудников/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяется действующая на заданную дату расценка на вид работ.
// Если дата не указана, возвращается последнее заданное значение.
//
// Параметры:
//	ВидРабот - СправочникСсылка.ВидыРаботСотрудников - вид работ,
//	ДатаАктуальности - Дата - дата сведений,
//	КвалификационныйРазряд - СправочникСсылка.РазрядыКатегорииДолжностей, Неопределено - квалификационный разряд.
//	Подразделение - СправочникСсылка.СтруктураПредприятия, Неопределено -
//	Организация - СправочникСсылка.Организации, Неопределено -
//
// Возвращаемое значение:
//  Число, Неопределено - действующая расценка или Неопределено, если ни одного значения не задано.
// 
Функция ДействующаяРасценкаВидаРабот(ВидРабот, ДатаАктуальности, КвалификационныйРазряд = Неопределено, Подразделение = Неопределено, Организация = Неопределено) Экспорт
	
	//++ Локализация
	ИспользоватьТарифныеСеткиПриРасчетеЗарплаты = ПолучитьФункциональнуюОпцию("ИспользоватьТарифныеСеткиПриРасчетеЗарплаты");
	//-- Локализация
	
	Если НЕ ЗначениеЗаполнено(ВидРабот) Тогда
		Возврат 0;
	КонецЕсли;
	
	ПараметрыВидыРабот = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВидРабот, "РасценкаПоТарифнойСетке, РасценкаЗаЧасРаботы, Трудоемкость, КратностьТрудоемкости");
	
	//++ НЕ УТКА
	
	//++ Локализация
	Если ПараметрыВидыРабот.РасценкаПоТарифнойСетке И ПолучитьФункциональнуюОпцию("НормированиеИРасценкаРаботПоТарифнымСеткам") И НЕ ИспользоватьТарифныеСеткиПриРасчетеЗарплаты
		Тогда
		
		ДополнительныйРазрез = Константы.ДополнительныйРазрезТарифнойСетки.Получить();
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ТарифныеСтавки.Тариф, 0) * ВидыРабот.Трудоемкость / ВидыРабот.КратностьТрудоемкости КАК Расценка
		|ИЗ
		|	Справочник.ВидыРаботСотрудников КАК ВидыРабот
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифныеСтавки.СрезПоследних(&Период) КАК ТарифныеСтавки
		|	ПО ВидыРабот.Должность = ТарифныеСтавки.Должность
		|	И ТарифныеСтавки.Разряд = &Разряд
		|	И ((ТарифныеСтавки.Подразделение = &Подразделение И ТарифныеСтавки.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|	ИЛИ ТарифныеСтавки.Организация = &Организация И ТарифныеСтавки.Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
		|	ИЛИ (ТарифныеСтавки.Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
		|	И ТарифныеСтавки.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)))
		|	И ТарифныеСтавки.Тариф <> 0
		|ГДЕ
		|	ВидыРабот.Ссылка = &ВидРабот
		|УПОРЯДОЧИТЬ ПО
		|	ТарифныеСтавки.Подразделение УБЫВ,
		|	ТарифныеСтавки.Организация УБЫВ");
		
		Запрос.УстановитьПараметр("ВидРабот", ВидРабот);
		Запрос.УстановитьПараметр("Период", ДатаАктуальности);
		
		Если ДополнительныйРазрез = Перечисления.ДополнительныеРазрезыТарифнойСетки.Подразделение Тогда
			Запрос.УстановитьПараметр("Подразделение", Подразделение);
			Запрос.УстановитьПараметр("Организация", ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка"));
		ИначеЕсли ДополнительныйРазрез = Перечисления.ДополнительныеРазрезыТарифнойСетки.Организация Тогда
			Запрос.УстановитьПараметр("Подразделение", ПредопределенноеЗначение("Справочник.СтруктураПредприятия.ПустаяСсылка"));
			Запрос.УстановитьПараметр("Организация", Организация);
		Иначе
			Запрос.УстановитьПараметр("Организация", ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка"));
			Запрос.УстановитьПараметр("Подразделение", ПредопределенноеЗначение("Справочник.СтруктураПредприятия.ПустаяСсылка"));
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(КвалификационныйРазряд) Тогда
			Запрос.УстановитьПараметр("Разряд", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидРабот, "КвалификационныйРазряд"));
		Иначе
			Запрос.УстановитьПараметр("Разряд", КвалификационныйРазряд);
		КонецЕсли;
		
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			Возврат Результат.Расценка;
		КонецЕсли;
		
	ИначеЕсли ПараметрыВидыРабот.РасценкаПоТарифнойСетке И ИспользоватьТарифныеСеткиПриРасчетеЗарплаты Тогда
		
		Если НЕ ЗначениеЗаполнено(КвалификационныйРазряд) Тогда
			Возврат 0;
		КонецЕсли;
		
		Запрос = Новый Запрос("
			|ВЫБРАТЬ
			|	МАКСИМУМ(ЗначенияТарифов.Тариф * ВидыРабот.Трудоемкость / ВидыРабот.КратностьТрудоемкости) КАК Расценка
			|ИЗ
			|	Справочник.ВидыРаботСотрудников КАК ВидыРабот
			|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Должности КАК Должности
			|	ПО ВидыРабот.Должность = Должности.Ссылка
			|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтатноеРасписание КАК ШтатноеРасписание
			|	ПО Должности.Ссылка = ШтатноеРасписание.Должность
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияТарифов.СрезПоследних(&Период) КАК ЗначенияТарифов
			|	ПО ЗначенияТарифов.ТарифнаяСетка = ШтатноеРасписание.ТарифнаяСетка
			|	И ЗначенияТарифов.РазрядКатегория = &Разряд
			|ГДЕ
			|	ВидыРабот.Ссылка = &ВидРабот");
		
		Запрос.УстановитьПараметр("ВидРабот", ВидРабот);
		Запрос.УстановитьПараметр("Период", ДатаАктуальности);
		Запрос.УстановитьПараметр("Разряд", КвалификационныйРазряд);
		
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			Возврат Результат.Расценка;
		КонецЕсли;
	КонецЕсли;
	//-- Локализация
	
	//-- НЕ УТКА
	
	Отбор = Новый Структура("ВидРабот", ВидРабот);
	
	ИспользоватьРазрядыРасценокРаботСотрудников = Истина;
	//++ НЕ УТКА
	ИспользоватьРазрядыРасценокРаботСотрудников = ПолучитьФункциональнуюОпцию("ИспользоватьРазрядыРасценокРаботСотрудников");
	//-- НЕ УТКА
	
	Если ИспользоватьРазрядыРасценокРаботСотрудников И Не ЗначениеЗаполнено(КвалификационныйРазряд) Тогда
		Отбор.Вставить("КвалификационныйРазряд", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидРабот, "КвалификационныйРазряд"));
	ИначеЕсли ИспользоватьРазрядыРасценокРаботСотрудников Тогда
		Отбор.Вставить("КвалификационныйРазряд", КвалификационныйРазряд);
	КонецЕсли;
	
	СтруктураРасценки = РегистрыСведений.РасценкиРаботСотрудников.ПолучитьПоследнее(ДатаАктуальности, Отбор);
	
	Расценка = СтруктураРасценки.Расценка;
	
	Если ПараметрыВидыРабот.РасценкаЗаЧасРаботы Тогда
		Расценка = СтруктураРасценки.Расценка * ПараметрыВидыРабот.Трудоемкость / ПараметрыВидыРабот.КратностьТрудоемкости;
	КонецЕсли;
	
	Возврат Расценка;
	
КонецФункции

// Определяется настройки отражения в бух. учете по умолчанию для указанного вида работ.
//
// Параметры:
//   ВидРабот - СправочникСсылка.ВидыРаботСотрудников - Вид работ.
//
// Возвращаемое значение:
//   Структура - Описание полей см. в ресурсах регистра сведений БухучетРаботСотрудников.
//
Функция БухучетВидаРабот(ВидРабот) Экспорт
	ДанныеРегистра = Неопределено;
	ИнтеграцияБЗК.ЗаполнитьПоДаннымРегистраБухучетВидаРабот(ДанныеРегистра, ВидРабот);
	Возврат ДанныеРегистра;
КонецФункции

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Параметры автозаполения трудоемкости.
// 
// Параметры:
//  Объект - СправочникОбъект.ВидыРаботСотрудников
// 
// Возвращаемое значение:
//  Неопределено, Структура - Параметры автозаполения трудоемкости:
// * Трудоемкость - Число
// * КратностьТрудоемкости - Число
Функция ПараметрыАвтозаполенияТрудоемкости(Объект) Экспорт
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Объект.ЕдиницаИзмерения, "ТипИзмеряемойВеличины,Числитель,Знаменатель");
	
	Если ЗначенияРеквизитов.ТипИзмеряемойВеличины = Перечисления.ТипыИзмеряемыхВеличин.Время
		И ЗначениеЗаполнено(ЗначенияРеквизитов.Числитель)
		И ЗначениеЗаполнено(ЗначенияРеквизитов.Знаменатель) Тогда
		
		Дробь = ПроизводствоСервер.Дробь(ЗначенияРеквизитов.Числитель, 3600 * ЗначенияРеквизитов.Знаменатель);
		ПроизводствоСервер.СократитьДробь(Дробь);
		
		Возврат Новый Структура("Трудоемкость,КратностьТрудоемкости", Дробь.Числитель, Дробь.Знаменатель);
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
